# Вывести квадрат числа
#a = 70
#print(a * a)

a = int(input('Введите число: '))
print('квадрат числа -', a * a)

#number = int(input('Введите число: '))
#print(f'{number}^2 == {number **2}')